# ImageBackgroundSettings Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImageBackgroundSettings Members
ImageBackgroundSettings Class Methods Properties See Also
---
The ImageBackgroundSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from BackgroundSettings.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BackgroundImageFit | The background image fit type. |
| FilePath | File path of the image for the rendering background. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from BackgroundSettings.) |
| OffsetHeight | The vertical offset of the rendering image to the rendering region. |
| OffsetWidth | The horizontal offset of the rendering image to the rendering region. |

# See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace